const fields = [

/* ===================================
1. ДАННЫЕ ПРОДАВЦА
=================================== */

{

    id:"seller",

    showAt:10,

    title:"1. Данные продавца",

    color:"#69d46b",

    areas:[

        {
            x:1,
            y:12,
            w:36,
            h:12
        },

        {
            x:50,
            y:12,
            w:36,
            h:12
        }

    ]

},


/* ===================================
2. ДАННЫЕ ПОКУПАТЕЛЯ
=================================== */

{

    id:"buyer",

    showAt:28,

    title:"2. Данные покупателя",

    color:"#ffae42",

    areas:[

        {
            x:1,
            y:25,
            w:36,
            h:18
        },

        {
            x:50,
            y:25,
            w:36,
            h:18
        }

    ]

},


/* ===================================
3. КОНТРАКТ
=================================== */

{

    id:"contract",

    showAt:46,

    title:"3. Дата и номер контракта",

    color:"#59a9ff",

    areas:[

        {
            x:39,
            y:35,
            w:10,
            h:10
        },

        {
            x:90,
            y:35,
            w:9,
            h:10
        }

    ]

},


/* ===================================
4. ТОВАР
=================================== */

{

    id:"product",

    showAt:66,

    title:"4. Наименование и описание товара",

    color:"#cc6cff",

    areas:[

        {
            x:1,
            y:38,
            w:35,
            h:18
        },

        {
            x:50,
            y:38,
            w:30,
            h:18
        }

    ]

},


/* ===================================
5. КОЛИЧЕСТВО И ЕДИНИЦЫ
=================================== */

{

    id:"quantity",

    showAt:88,

    title:"5. Единицы измерения и количество",

    color:"#ffd74f",

    areas:[

        {
            x:34,
            y:38,
            w:3,
            h:18
        },

        {
            x:80,
            y:38,
            w:3,
            h:18
        }

    ]

}

];
